/* Задание, орфография от автора:

Создаем класс шаблонный Arry3d<> который хранит одномерный массив, гно авдыает наружу его как трезхмерные. Переопрделеить операти=оры индексации [][][], <<
Сдлать методы GetValue0(int i) ->[][] GeValue1(int j) ->[][]  GetValues2(int k) -> [][]
GetValues01(int i, int j) -> []
GetValues02(int i, int k) ->[]
GetValues12(in j, int k) -> []
и аналогичные методы для SetValues
Сделать статический метод CrteaeFill для создания массива и присваивания всех элементов одному значению

*/
